**`teams/nomis/windows_server_2019_jumpserver`** terragrunt plan on `pull_request` event [#859](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: jumpserver_2019
            description: Jumpserver provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.0.0
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: ConfigureJava
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download/Install Java
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/jre-6u33-windows-i586.exe -File C:\jumpserver-software\jre-6u33-windows-i586.exe
                          Start-Process -Wait -FilePath "C:\jumpserver-software\jre-6u33-windows-i586.exe" -ArgumentList "/qn", "/s", "/v" -PassThru -RedirectStandardOutput "C:\jumpserver-software\jre-install.log"
            
                          # Copy deployment config files
                          $deployment_folder = "C:\Windows\Sun\Java\Deployment"
                          New-Item -Path $deployment_folder -ItemType Directory -Force
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.config -File $deployment_folder\deployment.config
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.properties -File $deployment_folder\deployment.properties
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/trusted.certs -File $deployment_folder\trusted.certs
            
                          # Prevent Java update check
                          Remove-ItemProperty -Path "HKLM:\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run" -Name SunJavaUpdateSched -Force -ErrorAction SilentlyContinue
                  - name: ConfigureTrustedSites
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Add Nomis sites to trusted sites
                          $sites = @(
                              "*.nomis.hmpps-test.modernisation-platform.internal"
                              "*.nomis.hmpps-test.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-production.modernisation-platform.internal"
                              "*.nomis.hmpps-production.modernisation-platform.justice.gov.uk"
                              "*.modernisation-platform.nomis.az.justice.gov.uk"
                          )
            
                          $paths = @(
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains"
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\EscDomains"
                          )
            
                          foreach($path in $paths){
                            $sites | ForEach-Object {
                                New-Item -Path $path\$_ -Force
                                New-ItemProperty -Path $path\$_ -Name http -Value 2 -PropertyType DWORD -Force
                                New-ItemProperty -Path $path\$_ -Name https -Value 2 -PropertyType DWORD -Force
                            }
                          }
            
                          # Use Local Machine settings for Internet Security Settings
                          $reg_path = "HKLM:\Software\Policies\Microsoft\Windows\CurrentVersion\Internet Settings"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name Security_HKLM_only -Value 1 -PropertyType DWORD -Force
        EOT
      + date_created = (known after apply)
      + description  = "Jumpserver provisioner component."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "jumpserver_2019"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "1.0.0"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: powershell_core
            description: Component to upgrade to using PowerShell Core
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.5
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - PowerShellCoreVersion:
                  type: string
                  default: 7.3.1
                  description: Version of the PowerShell Core to install
            phases:
              - name: build
                steps:
                  - name: InstallPowerShellCore
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          choco install -y chocolatey-core.extension
                          choco install -y kb3118401
                          choco install -y powershell-core --version '{{ PowerShellCoreVersion }}' --install-arguments='"ADD_EXPLORER_CONTEXT_MENU_OPENPOWERSHELL=1 REGISTER_MANIFEST=1 ADD_FILE_CONTEXT_MENU_RUNPOWERSHELL=1 ENABLE_PSREMOTING=1"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to upgrade to using PowerShell Core"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "powershell_core"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "0.1.5"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: prometheus_windows_exporter
            description: Component to install prometheus windows exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.1.3
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - WindowsExporterVersion:
                  type: string
                  default: 0.19.0
                  description: Version of the prometheus-windows-exporter
            phases:
              - name: build
                steps:
                  - name: InstallWMIExporter
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - choco install -y prometheus-windows-exporter.install --version '{{ WindowsExporterVersion }}' --params '"/ListenPort:9100"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to install prometheus windows exporter."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "prometheus_windows_exporter"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "1.1.3"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
        name         = "nomis_windows_server_2019_jumpserver"
      ~ tags         = {
          - "jumpserver-version"                      = "1.0.13" -> null
          + "jumpserver_2019-version"                 = "1.0.0"
            # (15 unchanged elements hidden)
        }
      ~ tags_all     = {
          - "jumpserver-version"                      = "1.0.13" -> null
          + "jumpserver_2019-version"                 = "1.0.0"
            # (15 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Windows Server 2019 jumpserver"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-1"
      + name                             = "nomis_windows_server_2019_jumpserver"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "Windows Server 2019 jumpserver"
      + id               = (known after apply)
      + name             = "nomis_windows_server_2019_jumpserver"
      + owner            = (known after apply)
      + parent_image     = (sensitive)
      + platform         = (known after apply)
      + tags             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.3"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-windows/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/ec2launch-v2-windows/x.x.x"
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-1"
        name                          = "nomis_windows_server_2019_jumpserver_0_0_1"
      ~ resource_tags                 = {
          - "jumpserver-version"                      = "1.0.13" -> null
          + "jumpserver_2019-version"                 = "1.0.0"
            # (15 unchanged elements hidden)
        }
      ~ tags                          = {
          - "jumpserver-version"                      = "1.0.13" -> null
          + "jumpserver_2019-version"                 = "1.0.0"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                      = {
          - "jumpserver-version"                      = "1.0.13" -> null
          + "jumpserver_2019-version"                 = "1.0.0"
            # (15 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

```
